amd/inference/vllm/data/max_seq_length.txt
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  748.82    
Total input tokens:                      128000    
Total generated tokens:                  150       
Request throughput (req/s):              0.00      
Output token throughput (tok/s):         0.20      
Total Token throughput (tok/s):          171.14    
---------------Time to First Token----------------
Mean TTFT (ms):                          734188.96 
Median TTFT (ms):                        734188.96 
P99 TTFT (ms):                           734188.96 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          98.17     
Median TPOT (ms):                        98.17     
P99 TPOT (ms):                           98.17     
---------------Inter-token Latency----------------
Mean ITL (ms):                           98.17     
Median ITL (ms):                         98.11     
P99 ITL (ms):                            110.03    
==================================================
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  221.57    
Total input tokens:                      64000     
Total generated tokens:                  150       
Request throughput (req/s):              0.00      
Output token throughput (tok/s):         0.68      
Total Token throughput (tok/s):          289.53    
---------------Time to First Token----------------
Mean TTFT (ms):                          209674.58 
Median TTFT (ms):                        209674.58 
P99 TTFT (ms):                           209674.58 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          79.79     
Median TPOT (ms):                        79.79     
P99 TPOT (ms):                           79.79     
---------------Inter-token Latency----------------
Mean ITL (ms):                           79.78     
Median ITL (ms):                         79.46     
P99 ITL (ms):                            96.88     
==================================================
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  73.37     
Total input tokens:                      32000     
Total generated tokens:                  92        
Request throughput (req/s):              0.01      
Output token throughput (tok/s):         1.25      
Total Token throughput (tok/s):          437.42    
---------------Time to First Token----------------
Mean TTFT (ms):                          66549.57  
Median TTFT (ms):                        66549.57  
P99 TTFT (ms):                           66549.57  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          74.89     
Median TPOT (ms):                        74.89     
P99 TPOT (ms):                           74.89     
---------------Inter-token Latency----------------
Mean ITL (ms):                           74.06     
Median ITL (ms):                         73.80     
P99 ITL (ms):                            87.16     
==================================================
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  33.84     
Total input tokens:                      16000     
Total generated tokens:                  138       
Request throughput (req/s):              0.03      
Output token throughput (tok/s):         4.08      
Total Token throughput (tok/s):          476.89    
---------------Time to First Token----------------
Mean TTFT (ms):                          23828.07  
Median TTFT (ms):                        23828.07  
P99 TTFT (ms):                           23828.07  
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          73.06     
Median TPOT (ms):                        73.06     
P99 TPOT (ms):                           73.06     
---------------Inter-token Latency----------------
Mean ITL (ms):                           72.54     
Median ITL (ms):                         72.19     
P99 ITL (ms):                            85.51     
==================================================
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  12.19     
Total input tokens:                      4000      
Total generated tokens:                  131       
Request throughput (req/s):              0.08      
Output token throughput (tok/s):         10.75     
Total Token throughput (tok/s):          339.01    
---------------Time to First Token----------------
Mean TTFT (ms):                          4106.86   
Median TTFT (ms):                        4106.86   
P99 TTFT (ms):                           4106.86   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          62.13     
Median TPOT (ms):                        62.13     
P99 TPOT (ms):                           62.13     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.60     
Median ITL (ms):                         68.46     
P99 ITL (ms):                            101.90    
==================================================
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  8.19      
Total input tokens:                      2000      
Total generated tokens:                  100       
Request throughput (req/s):              0.12      
Output token throughput (tok/s):         12.22     
Total Token throughput (tok/s):          256.54    
---------------Time to First Token----------------
Mean TTFT (ms):                          1925.63   
Median TTFT (ms):                        1925.63   
P99 TTFT (ms):                           1925.63   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          63.21     
Median TPOT (ms):                        63.21     
P99 TPOT (ms):                           63.21     
---------------Inter-token Latency----------------
Mean ITL (ms):                           62.18     
Median ITL (ms):                         72.22     
P99 ITL (ms):                            102.83    
==================================================
============ Serving Benchmark Result ============
Successful requests:                     1         
Benchmark duration (s):                  7.65      
Total input tokens:                      1000      
Total generated tokens:                  109       
Request throughput (req/s):              0.13      
Output token throughput (tok/s):         14.24     
Total Token throughput (tok/s):          144.91    
---------------Time to First Token----------------
Mean TTFT (ms):                          961.41    
Median TTFT (ms):                        961.41    
P99 TTFT (ms):                           961.41    
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          61.95     
Median TPOT (ms):                        61.95     
P99 TPOT (ms):                           61.95     
---------------Inter-token Latency----------------
Mean ITL (ms):                           61.02     
Median ITL (ms):                         68.58     
P99 ITL (ms):                            102.02    
==================================================